also having the same issue

tf file:
```
data "template_file" "user_data" {
  template = file("${path.module}/files/user_data.config")
  vars = {
    pubkey   = file(var.ssh_pubkey_path)
    hostname = var.vm-name
    domain   = var.domain
  }
}

resource "local_file" "cloud_init_user_data_file" {
  content  = data.template_file.user_data.rendered
  filename = "${path.module}/files/${var.vm-name}_user_data.config"
}

resource "null_resource" "cloud_init_config_file" {
  connection {
    type        = "ssh"
    user        = "root"
    private_key = file(var.ssh_key_path)
    host        = var.host
  }

  provisioner "file" {
    source      = local_file.cloud_init_user_data_file.filename
    destination = "/ssd-mirror/share/pve/snippets/${var.vm-name}_user_data.yml"
  }
}

# create vm
resource "proxmox_vm_qemu" "vm" {

  depends_on = [
    null_resource.cloud_init_config_file,
  ]

  name        = var.vm-name
  target_node = "pve"

  clone      = "debian-cloudinit"
  full_clone = true
  onboot     = true
  agent      = 1

  os_type  = "cloud-init"
  cores    = 1
  sockets  = "1"
  cpu      = "host"
  memory   = 512
  scsihw   = "virtio-scsi-pci"
  bootdisk = "scsi0"

  disk {
    size    = "8G"
    type    = "scsi"
    storage = "data"
  }

  cicustom = "user=software:snippets/${var.vm-name}_user_data.yml"

  lifecycle {
    ignore_changes = [
      network
    ]
  }
}
```

tf output:
```
terraform apply -var="vm-name=test01"

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.cloud_init_user_data_file will be created
  + resource "local_file" "cloud_init_user_data_file" {
      + content              = <<-EOT
            #cloud-config
            
            package_update: true
            package_upgrade: true
            
            bootcmd:
              - [ cloud-init-per, once, dirmngr-aptupdate, apt-get, update ]
              - [ cloud-init-per, once, dirmngr-aptinstall, apt-get, install, dirmngr, -y ]
              - [ cloud-init-per, once, dirmngr-aptinstall, apt-get, install, gnupg2, -y ]
            
            packages:
              - jq
              - curl
              - qemu-guest-agent
            
            users:
            - name: debian
              groups: sudo
              shell: /bin/bash
              sudo: ['ALL=(ALL) NOPASSWD:ALL']
              ssh_authorized_keys:
                - ssh-rsa AAAAB3NzaC1yc2EA..
                          
            preserve_hostname: false
            manage_etc_hosts: false
            fqdn: test01.klee.lab
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/test01_user_data.config"
      + id                   = (known after apply)
    }

  # null_resource.cloud_init_config_file will be created
  + resource "null_resource" "cloud_init_config_file" {
      + id = (known after apply)
    }

  # proxmox_vm_qemu.vm will be created
  + resource "proxmox_vm_qemu" "vm" {
      + agent                  = 1
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "cdn"
      + bootdisk               = "scsi0"
      + cicustom               = "user=software:snippets/test01_user_data.yml"
      + clone                  = "debian-cloudinit"
      + clone_wait             = 15
      + cores                  = 1
      + cpu                    = "host"
      + define_connection_info = true
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + kvm                    = true
      + memory                 = 512
      + name                   = "test01"
      + nameserver             = (known after apply)
      + numa                   = false
      + onboot                 = true
      + os_type                = "cloud-init"
      + preprovision           = true
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + target_node            = "pve"
      + vcpus                  = 0
      + vlan                   = -1
      + vmid                   = (known after apply)

      + disk {
          + backup      = false
          + cache       = "none"
          + file        = (known after apply)
          + format      = "raw"
          + iothread    = false
          + mbps        = 0
          + mbps_rd     = 0
          + mbps_rd_max = 0
          + mbps_wr     = 0
          + mbps_wr_max = 0
          + media       = (known after apply)
          + replicate   = false
          + size        = "11G"
          + storage     = "data"
          + type        = "scsi"
          + volume      = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

local_file.cloud_init_user_data_file: Creating...
local_file.cloud_init_user_data_file: Creation complete after 0s [id=5d4ed398413c32868ceccb60d9f1e398e040470a]
null_resource.cloud_init_config_file: Creating...
null_resource.cloud_init_config_file: Provisioning with 'file'...
null_resource.cloud_init_config_file: Creation complete after 0s [id=5465082515012412590]
proxmox_vm_qemu.vm: Creating...
proxmox_vm_qemu.vm: Still creating... [10s elapsed]
proxmox_vm_qemu.vm: Still creating... [20s elapsed]

Error: rpc error: code = Unavailable desc = transport is closing


panic: runtime error: index out of range [1] with length 0
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: goroutine 44 [running]:
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/Telmate/terraform-provider-proxmox/proxmox.initConnInfo(0xc000354780, 0xc000319f40, 0xc000226460, 0xc000318370, 0xc00001b498, 0xc00001b328, 0x0, 0x0)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/Telmate/terraform-provider-proxmox/proxmox/resource_vm_qemu.go:1487 +0x126e
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/Telmate/terraform-provider-proxmox/proxmox.resourceVmQemuCreate(0xc000354780, 0xb486e0, 0xc000319f40, 0x0, 0x0)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/Telmate/terraform-provider-proxmox/proxmox/resource_vm_qemu.go:871 +0x1a7d
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0xc00031a8f0, 0xdb4ea0, 0xc0003dc100, 0xc000354780, 0xb486e0, 0xc000319f40, 0x0, 0x0, 0x0)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/helper/schema/resource.go:268 +0x88
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0xc00031a8f0, 0xdb4ea0, 0xc0003dc100, 0xc00013c310, 0xc0001acba0, 0xb486e0, 0xc000319f40, 0x0, 0x0, 0x0, ...)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/helper/schema/resource.go:386 +0x681
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/helper/plugin.(*GRPCProviderServer).ApplyResourceChange(0xc00030a180, 0xdb4ea0, 0xc0003dc100, 0xc00013c070, 0xc00030a180, 0xc00030a190, 0xcc0370)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/helper/plugin/grpc_provider.go:952 +0x8b2
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/tfplugin5._Provider_ApplyResourceChange_Handler.func1(0xdb4ea0, 0xc0003dc100, 0xc51e20, 0xc00013c070, 0xc0003dc100, 0xbd4d20, 0xc000304401, 0xc0000ad480)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/tfplugin5/tfplugin5.pb.go:3312 +0x86
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/plugin.Serve.func3.1(0xdb4f60, 0xc000302990, 0xc51e20, 0xc00013c070, 0xc0000ad460, 0xc0000ad480, 0xc00049cba0, 0x585e28, 0xc2a1e0, 0xc000302990)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/plugin/serve.go:76 +0x87
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/tfplugin5._Provider_ApplyResourceChange_Handler(0xc600a0, 0xc00030a180, 0xdb4f60, 0xc000302990, 0xc000304420, 0xc0000acbc0, 0xdb4f60, 0xc000302990, 0xc000010000, 0x72b)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/tfplugin5/tfplugin5.pb.go:3314 +0x14b
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).processUnaryRPC(0xc00033e540, 0xdbda80, 0xc000083b00, 0xc000312200, 0xc000280930, 0x12e0820, 0x0, 0x0, 0x0)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:1171 +0x50a
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).handleStream(0xc00033e540, 0xdbda80, 0xc000083b00, 0xc000312200, 0x0)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:1494 +0xccd
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).serveStreams.func1.2(0xc00030c150, 0xc00033e540, 0xdbda80, 0xc000083b00, 0xc000312200)
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:834 +0xa1
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: created by google.golang.org/grpc.(*Server).serveStreams.func1
2020-12-19T14:44:04.784+0100 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:832 +0x204
2020-12-19T14:44:04.787+0100 [DEBUG] plugin: plugin process exited: path=.terraform/providers/registry.terraform.io/telmate/proxmox/2.6.5/linux_amd64/terraform-provider-proxmox_v2.6.5 pid=69602 error="exit status 2"
2020-12-19T14:44:04.787+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/19 14:44:04 [DEBUG] proxmox_vm_qemu.vm: apply errored, but we're indicating that via the Error pointer rather than returning it: rpc error: code = Unavailable desc = transport is closing
2020/12/19 14:44:04 [TRACE] EvalMaybeTainted: proxmox_vm_qemu.vm encountered an error during creation, so it is now marked as tainted
2020/12/19 14:44:04 [TRACE] EvalWriteState: removing state object for proxmox_vm_qemu.vm
2020/12/19 14:44:04 [TRACE] EvalApplyProvisioners: proxmox_vm_qemu.vm has no state, so skipping provisioners
2020/12/19 14:44:04 [TRACE] EvalMaybeTainted: proxmox_vm_qemu.vm encountered an error during creation, so it is now marked as tainted
2020/12/19 14:44:04 [TRACE] EvalWriteState: removing state object for proxmox_vm_qemu.vm
2020/12/19 14:44:04 [TRACE] vertex "proxmox_vm_qemu.vm": visit complete
2020/12/19 14:44:04 [TRACE] dag/walk: upstream of "meta.count-boundary (EachMode fixup)" errored, so skipping
2020/12/19 14:44:04 [TRACE] dag/walk: upstream of "provider[\"registry.terraform.io/telmate/proxmox\"] (close)" errored, so skipping
2020/12/19 14:44:04 [TRACE] dag/walk: upstream of "root" errored, so skipping
2020/12/19 14:44:04 [TRACE] statemgr.Filesystem: no original state snapshot to back up
2020/12/19 14:44:04 [TRACE] statemgr.Filesystem: state has changed since last snapshot, so incrementing serial to 3
2020/12/19 14:44:04 [TRACE] statemgr.Filesystem: writing snapshot at terraform.tfstate
2020/12/19 14:44:04 [TRACE] statemgr.Filesystem: removing lock metadata file .terraform.tfstate.lock.info
2020/12/19 14:44:04 [TRACE] statemgr.Filesystem: unlocking terraform.tfstate using fcntl flock
2020-12-19T14:44:04.796+0100 [DEBUG] plugin: plugin exited
2020-12-19T14:44:04.796+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-19T14:44:04.796+0100 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-19T14:44:04.804+0100 [DEBUG] plugin: plugin process exited: path=/usr/bin/terraform pid=69537
2020-12-19T14:44:04.804+0100 [DEBUG] plugin: plugin exited
2020-12-19T14:44:04.808+0100 [DEBUG] plugin: plugin process exited: path=/usr/bin/terraform pid=69484
2020-12-19T14:44:04.808+0100 [DEBUG] plugin: plugin exited
```